  List<Map<String, String>> governorates = [
  {'name': 'أمانة العاصمة', 'code': '1'},
  {'name': 'صنعاء', 'code': '2'},
  {'name': 'عدن', 'code': '3'},
  {'name': 'تعز', 'code': '4'},
  {'name': 'إب', 'code': '5'},
  {'name': 'الحديدة', 'code': '6'},
  {'name': 'البيضاء', 'code': '7'},
  {'name': 'حضرموت', 'code': '8'},
  {'name': 'لحج', 'code': '9'},
  {'name': 'المهرة', 'code': '10'},
  {'name': 'شبوة', 'code': '11'},
  {'name': 'صعدة', 'code': '12'},
  {'name': 'عمران', 'code': '13'},
  {'name': 'الجوف', 'code': '14'},
  {'name': 'حجة', 'code': '15'},
  {'name': 'المحويت', 'code': '16'},
  {'name': 'سقطرى', 'code': '17'},
  {'name': 'ذمار', 'code': '18'},
  {'name': 'ريمة', 'code': '19'},
  {'name': 'مأرب', 'code': '20'},
  {'name': 'الحدود الشمالية', 'code': '21'}, 
  {'name': 'الضالع', 'code': '22'},
];



List<Map<String, dynamic>> data = [
  {
    'id': '001',
    'desc': 'Y12345',
    'val1': 'سرعة زائدة',
    'val2': 'رقيب علي',
    'val3': 'خاصة',
    'date': '2025/8/7',
    'idu':'1'
  },
  {
    'id': '002',
    'desc': 'A99887',
    'val1': 'تجاوز إشارة',
    'val2': 'رقيب محمد',
    'val3': 'حكومي',
    'date': '2025/8/10',
        'idu':'2'

  },
];

List<Map> user = [
  {"idu": '1', "nameu": "محمد", "pasu": "12344"},
];
List<String> violations = [
  'تجاوز السرعة',
  'الوقوف الخاطئ',
  'عدم ربط الحزام',
  'قطع إشارة',
  'الوقوف المزدوج بلمركبة في الشوارع الرئيسية',
  'عكس خط',
  'عرقلة السير في الطريق',
  'ممنوع الدخول يمين - يسار',
  'عدم وجود أنوار',
  'السير -الوقوف وسط الطريق(المشاة)',
  'تجاوز غير مأمون',
  'لا يحمل وثائق مركبه',
  'لايحمل رخصه قياده',
  ' تجاوز السرعة المحددة',
  ' قيادة بطيش وإهمال',
  'يسوق بدون رخصة',
];

List<String> selectedViolations = [];
